#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "9dfa898706165e06fee5786a51040cb4" -> "c55c870d3b5b05676588511adaa0474f"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "f7d4edc078bda15294565d6cfdbb4737" -> "d0cf51bc1774d2424f1adc444198f290"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "970b7c4bf1defaa1f499971e2f7dadc3" -> "444e623f97871ac85de5a4ed6f6a2bcb"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "3fa3575a0f5112e5c8c40afd55a758b0" -> "db388626caec53fdb8126080cd96f278"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "0d464f3283f262cbf398ef393004c540" -> "dfadb0c01696c36b97251a32b0c77095"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "016542daaf80f0c180aa8f18538d3dfc" -> "6d3171dadd2a7a87824f86b3a29ecb7b"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "c6259c5a67c3cf8fb3ac4bedf5ccd3b6" -> "13c0a2986cb7d4d51f0f7d47dc5b070f"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "46680c67f504af0c44590134fa7ab838" -> "2851a282307daca594ed767f30284152"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "73b6dc0f9e328b1816fa39283cff23ad" -> "75071f048f92f94926e41a0aea6ea821"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "17fadbf5bf91ace5143a5bff090faa0b" -> "7bbae2ed7b413461b437a6f3e7792237"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "fc0e5fcadb4245c70c1bd5b2aa565be6" -> "edba536e21206d26b573c2a81eb647ab"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "cf54d329a8f017242dc7a520d6e36bc7" -> "efd0e005e9c849b01dfe06f544049fe6"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "85f36bc683aed55811b365952aaff534" -> "76831a4604f97bd235567ca49a8fbd52"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "4e856f4d1b73d6a2d45357bffae91d5a" -> "1492b59dd7bbcb46e6dcb59f5c249030"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "2a0240eaea5433be9626abd29dcca298" -> "eeeb123613d22bf421c0dbafb0448a69"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "c2226ca979dca0e1937d757a23368892" -> "c49a01601df91ddb9662df88cd7a6f23"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "b3b756f720dc6616e83d10ce3c3b23a6" -> "c342cdb7a7d211fe7b2551ed70655196"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "e88e48fbf7e3454e6ba1b752b7200074" -> "cb99d960a13d190b8410439a6c31eb18"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "15d804038a669bbedba23babc581ca02" -> "79597e4349d4630413202dd077400739"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "a951b2420b06664046f510d417b58cf1" -> "4da7a932a8df367a8a1e77c7a542eaa3"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "4ae13af65e628ac94e0a4a61409a27d0" -> "27dcbab462173ad1ebbfa5f6b07c6a55"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "4b710a6eb51ffb8a3cbdcf1a00d8bd6d" -> "197e25442c132df63bf35e56e80f08d5"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "38eb2b445c60b083aae5bc5b013eebe7" -> "ebffacfdcefd6c69f69587f447fa6ce3"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "1dfb7ebc0fcaaad1afa567aaef27b5eb" -> "67ff74ac821bf504c3f7e6eab4816989"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "289c3dd493563906c7488b5fdc5c0604" -> "45949f32e65eb5a07908875e91728559"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "cb3fee2cc35e48109801f753484ff7ac" -> "4f5c361e37684de2d8268baf5b7fd374"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "e38f25ef87b26bb1c8177263d0a36c2f" -> "94e5f469c29cb8ee0f6ea02a362b898d"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "abbc5edf82350fb0547c107088d026c9" -> "cdec2594704b8fc33913d0a393a33937"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "c6467d705ac18c70bab6f2ab56032e78" -> "72745b1e3273ece5fa67c8d32410fa0e"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "1b084492e1b80e145b9ea3392fc6c8ab" -> "7966ede52b20b02902752be53c078f1e"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "62d7077847632fb1ffdaedccafd5961c" -> "8b7ab6896d27b5241a8b3c35a92c0bff"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "53fd74a9e5ad9dc42689d9662223183b" -> "fed58a2cdd0f65b56517793dc0a2ddca"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "c0eb681921fb2e54d75154546bb7a128" -> "96afdaf132d0382cbd6bab768933dca4"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "b1c641e4df619b5937437173fcc85642" -> "d486b8c19d2a037c3c5106a755a9c696"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "3a0a082f04922f129fa7cea523f8f1da" -> "e85b22247211ebaadf4db813efc5a188"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "db024e45b13fc4edd5998723f8c07434" -> "8393ae2d29e6ad43991c7be017f9c902"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "769882068a1d2207aa75ad4d4b090054" -> "d1c2807710dbc7f45a0cb8bc12343f99"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "d3645613e032a32a24478e03c698c453" -> "16a599a8cd9d7ef7c58bc8f0c1c55a2c"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "cfdf65af28517a3028b411b05c3945c8" -> "0eb2d88e43bc8abf39b2a92f65cb0bad"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "570ebd803319745416a5ec1c2e3b3d1e" -> "2cbb65e2db86fdc06873e5cc92242c39"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "9bd92fbf2e3c88037ae4d40d95ae30da" -> "1dad5d5f19423a05a193f9533d7d07b5"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "4894514ec3154ab067ac95c5109879b3" -> "0b349e953f1a575932062fde39183f48"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "2a9498fc952184fe7fe5f33f28d79297" -> "4bac2d96fb54e9eb2f51bbaf0e950b6a"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "73d080922ea50a7347c063a932894f7c" -> "a1d3e39fba7f1868f7b00ddbeac1eb0d"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "81b0157ed85d1c597d65afe145175ac9" -> "2db5ee09ffbf6d9571e654c968f994b3"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "71d3e0a7ccf4fb1585ad81053fa793f6" -> "b397c18bff80344eeb294e4c0a45d3fa"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "55f28fa4dd4a73b65b546d9198b4f5cd" -> "a48143432dfacdaa1f17325b9978ef1a"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "vr7QrhnFA8t9frYLxEk3+sgOQwgxvoCJ3v/xZQWqajw=" -> "iFDoSFVgiEsuXhsobPLtHuVi26UxhVasAQWQzR4h2E0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "OfKiET7fSTptKruCAi3eIfVpvo1AaKOssyfXwb41WnE=" -> "cpckF53n2WJXH8RM84u4IE0GbcyIkiEDD4Qt3Yk7sEc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "S4ee+qHw8+SM/BDZJU1boiGllIG2EPOskqAXyHr++fY=" -> "/VY2GxeLuouv7Lkoi7Twy1A41jXYQtkbfKAIok8QTPQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "CaVX2Xf6WjmmlEWACLVBKDPapUE/RuV8fOZEYq/auKs=" -> "tr80JgQQkjjXMYnLBpOKP9yj/C5EQkAm5/UHEFK4f+s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "NOwxYsyEDmsLGOpTAnLftN7FC97RVb/Th1diQHwwXlc=" -> "ZtmGKambn7zovqaazJEsckkkKToNOrDSJBZLYBUD8PI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "WZuN1QLX5A0bMwgp1PnP6FGDTvoVzD9der+Zvflc6o4=" -> "7TuoP5adEpNuv1KvK/dWHXIRcD+BxoP1ttQknjCE+2o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "CcIxqTF7qPtWfTkShvjh7XkvjPxPC5g9gI69l+/O3WA=" -> "5MFXPRBHL76atw+jnZNiOmQ2iohtskJ1uO+LAJfIy/Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "QFwEsl5V9rTSbBXtOq9/3GetewBME9ft5t6ndqMJOq0=" -> "27WY2D3rq1xdqAvg4nmZy11Cd6BYNZ79dY0i2vfoY2A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "GmGWM8ttJWYL2bxlEkkqKIPE9jG+7PwW+i2nAgSIIxs=" -> "rU2yEchfN3b/WT+bKLXrmrc1NmRIZcvwivKbp12cxV4="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "BpmH+dwHEYjKrUWMr8krlWtFN05z2qxW5bzqN/b7M2I=" -> "dDmdwGck24iwSJFPcrNpG/LkhlDn6CSSuZ+lJ6Tann0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "iYC48jujmYvuimJJ5OnhtKKgTMYySsYGnn1D/MZNUCs=" -> "H1E2Xh848c+gNK7fXVbvs8ZzfdMOJ08/fUQh7DyJEpw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "jF7kV8VgN0fvl7DhjsNUF435u3gqVHKxmozUU0KQQ5c=" -> "pS6uhF8OzCyj5+jR+l67dR0vRzEKEM5L4q14dgv6JHs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "V/fGpvPr7mk7kXto08QfyMgLyVNu0l/iE1Ohy3aEpGg=" -> "fkZILVT9006ksd9tnrgb3gpKlQ+Cfc8mUI3bfr+bq/M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "9V9ulfqtQpRnv04XCDI4td/RQcpY1WiWmvu1GLaYUIc=" -> "Zz/Gmq/fnV5c8bYKAg11t5C0bvijrFyFWhl0ojqTCeQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "kAD5QQO1vw881BKmJijTBg1uGb2YwLj3Kgy79NfFP0c=" -> "oQwlZ9cj14RoWXDgn7kLvUU7+SR6y3zpSu2vs4zyZoo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "hpx8rPd/R1upgj1Evlu8ROO4g6c2F812XhPm2wixlfo=" -> "mhkBeb/1scpnZCUUXHFvem564jVOH6gZqbcwzBa+SdI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZdKjnfBpu1thx2oCBi8ofW+0mYW6l/gT7sLSjvPHOZE=" -> "hAO9bKnnSCof8ZXYYMZ0GhUf2t1CzpUJaVi74csYOGQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "UojKfN8YCvdfMvdiJCfX+mMHqoVxaYrSgNDjKgo6WGo=" -> "3QY//WCFeNGPsWS9sd1Xlmh/gxL+C9+0O3QIVCudFAw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "BCg9tUn+7iiyfaLqwLbWgXqc5lHcmEAOfhrEgWHLfTM=" -> "xmq5a4xUjWsFWqFUPiicDNU5/DjohsNd6QUS/DU3qEI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "PntiIDQmYUeA0iaGrl5Bo42F9b/zKz0Jo+vIVl/uqyk=" -> "q4f3nc1NPY1FlWM6CoUQO2CuicSgLVy8LtSyY6j6H/Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "cgTg9aqLS/7ad8gEhvyMMSwo+JQa2b6RQdU8ub+Luq4=" -> "S3pairPvAbwl6erj7pB5dvqCBbG3ZJ5Z/oqhQh39D+A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "n8H/BiddRAkkdXQ+O0EgjpGwJJB2ouRkwvmgAC672u8=" -> "aMoSyMFU4LQ30MmByex8XYRFg4B0yRMkt2djfiGEHJ8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "imTynxs4TwjJsaS6tkqyqiU6Bkx5cs02QIQiNvc9Uh8=" -> "zRZ85jEEBhjmBVPQyIKWBaA14U17rcwWrwmAPNd6bNY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "c+Vr/Vh1jJUTSOACQmqGwjm7rdxHY0GbW2yrLAMj814=" -> "QBdMAqGmCMi3gUof/CDl5BzGtSQxk5pTw1a3Nro1deY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ux6YyJEo9q7PNdQDXHiwgb0rrRmk+iNWrWTj074hGZ0=" -> "QXs+Lqob3Rgi6r7bpTYEUcs13GkBBOUerch23k02d0I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "dpPlC/ilBFFhxOYXwvzRWfdsBqpybWocnow+rsCBNTI=" -> "DKTPhu/A28HnMeECIAPXK+7xCHnJngcSsDlUMdgXxbc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "OiTFYPO+aubAY7r1KgGicMg96e2voqNaTbMpvc2WnIY=" -> "Lt/hVeMsnAyQw68xgKtuqTw5E8H+St0jSvmqo7lBRHg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "WP7dnjKJfipoQ7Qwd/WMeDoAqKcY9amt8EzIo0Rgm9o=" -> "Vrrg2ws0cioIdZCJwbu8Ba1sfPyTVGwbgIWQqh2Nce0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "q7UfKocfLxSdFJpx78BH2puJxxlcdJqVMTPR2vQe9vA=" -> "CzKusvfV7hHb8lF0p92U/EWuA4QorrVhfwlp8nwA8jY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "tpS1U9Z5EWsbvJ22Gebp2q5d+Rha5ROifSBpRzDe2z4=" -> "Bn8SxmV00oqKVgPXJgRos2U7rpBQoU24gz8OG1ebcrI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "xZh8MKgogEhby4yv+0WzGdPm3BjZGDOWPevuCzLYyHE=" -> "Yf38Q2nhKR4BURHKtgeUqZ/a1slB44G92+wGs9XstEY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "hvcVYR9coVEp9/xdxoNbyPwyKM2Hv2trjKWymEY9QCw=" -> "KuI+Fwe7j9pmFckG5vDrMch5eGc2MSQYjZD1WtPxtxc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "zP9mWIr1qBfsIWU5+X1QavzeBr6JgkxNBFssZsnDwXQ=" -> "upJcrAfiblFuWUmogf4M8Ca24qsDkxx8jVUj+GiMAwQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "DPl2jPVb+cRwssZ7zZuWbKSwqkVfXOPjwb6UGEcYAhQ=" -> "DmBc4DuiUbvU76irLetFclC0sTJsxSubtVBFfpzJ0Ic="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "S2Q5x/riPAAexMLNJEwtllgImcWdZboGh05VwKodwHc=" -> "eO9nQFaQF7ByT9YbWdWkdYpU1KNPt5mxtbwd4yupYlg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "JqbHgTvnMAwRBy0/M1NSE3Ni60EH4PCwBfjdHYXVBt4=" -> "EdmIgQubQ005Y53HlVorMZhGPVqe2uaOu4Yk8xROEpk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "/yJShIEG7ngEWc5BPmKSkJkbaqR56B5MIGAUu+Ga8xM=" -> "XwE23ZQ7PwOABHENv383GaufY0EJmNy/A3e8mnTOD+c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "m3D9KozMG7tlqi29QgIIDP6LUfzPzb74ic/9yGZRTao=" -> "CaXV61DAUfVY3IDGdF4pVHwcFyru/U9ykyE0B2iYdu0="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "8W2r67VfWc58ROol2GoZ5Ohg5weHdqEE86MZjH41jjk=" -> "5+o06TAkWl+FsQdk4eSI4YhBH9PBVGSSOWmyu89j4JE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "Z6iXU2Xl7Jswk5KptoRuoNFraddADHzEIZz7lqLyX40=" -> "c//lOdh6GuSwA/k/6c2xGBHkri4QG5fowUupERxPS44="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "xaVn/8EHWkR3pt5t+6o27iEAmuXMWuv9mg4T6OEQtb8=" -> "lqUbzRb8MgWfStcXDyfEwUfn/++27ntozUMQIMTNTdI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "Kz3ylBq8c14k13cr2WZQDH47cHOlLGl0NUOVF01ifw0=" -> "pekI4rqJjA6B/B3FXpc3h0yDZmw29/lpPM8PLv9MFII="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "qCP3o5noUURd1OoLCNRC1skcQ7MWc6mcS8Sq6ygCJbI=" -> "g4vg6TWpfI5TlRB4jln9oS+0QIZYHqRfJOhYOrHsj+Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "gJVPbubwmLTDEAz6O6o9/kmPIV9vNahTEHmweTquh6U=" -> "gbDzFQqCuQHdqgfetkyjcZNC5DngFx9EveeEOqrKFug="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "02A+jeS74O2i83wYRA4JPKJqWtILDJK5CIrIIG/CzUs=" -> "sSGslrS4DbJ1RryFEpLwhxok0XMyamd/JwQUNcrCDyI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "L3NIq7fOjadd0meOAQCM/S3Q4hEUci656YK/pYNGdeI=" -> "upPfxW07vcRUUMENKXlHiANfg9rsn4gQaheP90u+5oA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-03-01T03:34:20Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "vzsy71" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-03-01T03:34:19Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-03-01T03:34:18Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*